{
    "_id":  "fn1jAPeUTszMyJXl",
    "name":  "Xorannox",
    "type":  "npc",
    "img":  "modules/flee-mortals-custom/tokens/xorannox.webp",
    "system":  {
                   "abilities":  {
                                     "str":  {
                                                 "value":  10
                                             },
                                     "dex":  {
                                                 "value":  16
                                             },
                                     "con":  {
                                                 "value":  18
                                             },
                                     "int":  {
                                                 "value":  19
                                             },
                                     "wis":  {
                                                 "value":  14
                                             },
                                     "cha":  {
                                                 "value":  18
                                             }
                                 },
                   "attributes":  {
                                      "ac":  {
                                                 "flat":  18,
                                                 "calc":  "default",
                                                 "formula":  ""
                                             },
                                      "hp":  {
                                                 "value":  228,
                                                 "max":  228,
                                                 "temp":  0,
                                                 "tempmax":  0,
                                                 "formula":  "24d10 + 96"
                                             },
                                      "init":  {
                                                   "ability":  ""
                                               },
                                      "movement":  {
                                                       "walk":  0,
                                                       "fly":  20,
                                                       "swim":  0,
                                                       "climb":  0,
                                                       "burrow":  0,
                                                       "hover":  true,
                                                       "units":  "ft"
                                                   },
                                      "senses":  {
                                                     "darkvision":  120,
                                                     "blindsight":  0,
                                                     "tremorsense":  0,
                                                     "truesight":  0,
                                                     "units":  "ft",
                                                     "special":  ""
                                                 }
                                  },
                   "details":  {
                                   "cr":  14,
                                   "xp":  {
                                              "value":  11500
                                          },
                                   "type":  {
                                                "value":  "aberration",
                                                "subtype":  "",
                                                "custom":  ""
                                            },
                                   "alignment":  "Lawful Evil",
                                   "source":  {
                                                  "book":  "Flee, Mortals!"
                                              }
                               },
                   "traits":  {
                                  "size":  "lg",
                                  "di":  {
                                             "value":  null
                                         },
                                  "dr":  {
                                             "value":  null
                                         },
                                  "dv":  {
                                             "value":  null
                                         },
                                  "ci":  {
                                             "value":  [
                                                           "charmed",
                                                           "frightened",
                                                           "prone"
                                                       ]
                                         },
                                  "languages":  {
                                                    "value":  [
                                                                  "common",
                                                                  "deep speech",
                                                                  "undercommon"
                                                              ],
                                                    "custom":  ""
                                                }
                              },
                   "skills":  {
                                  "ins":  {
                                              "value":  1
                                          },
                                  "dec":  {
                                              "value":  1
                                          },
                                  "per":  {
                                              "value":  1
                                          },
                                  "arc":  {
                                              "value":  1
                                          },
                                  "int":  {
                                              "value":  1
                                          }
                              }
               },
    "items":  [
                  {
                      "img":  "icons/svg/aura.svg",
                      "type":  "feat",
                      "system":  {
                                     "activation":  {
                                                        "type":  ""
                                                    },
                                     "description":  {
                                                         "value":  "\u003cp\u003eEight eyes float around Xorannox and create his Eye Psionics. If Xorannox fails a saving throw, he can destroy a random floating eye (chosen by rolling a d8) and succeed instead. If an eye is destroyed, a new eye pops of out of Xorannox\u0027s face to replace it 24 hours later.\u003c/p\u003e"
                                                     },
                                     "source":  {
                                                    "book":  "Flee, Mortals!"
                                                },
                                     "type":  {
                                                  "value":  "monster",
                                                  "subtype":  ""
                                              }
                                 },
                      "name":  "Painful Resistance (3/Day)",
                      "_id":  "cgAm1llPpBm2L3lI"
                  },
                  {
                      "img":  "icons/svg/sword.svg",
                      "type":  "weapon",
                      "system":  {
                                     "ability":  "str",
                                     "damage":  {
                                                    "parts":  [
                                                                  [
                                                                      "4d6",
                                                                      "piercing"
                                                                  ]
                                                              ]
                                                },
                                     "source":  {
                                                    "book":  "Flee, Mortals!"
                                                },
                                     "description":  {
                                                         "value":  "\u003cp\u003eMelee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 14 (4d6) piercing damage.\u003c/p\u003e"
                                                     },
                                     "target":  {
                                                    "value":  1,
                                                    "type":  "creature"
                                                },
                                     "attackBonus":  "5",
                                     "actionType":  "mwak",
                                     "range":  {
                                                   "units":  "ft",
                                                   "long":  null,
                                                   "value":  5
                                               }
                                 },
                      "name":  "Bite",
                      "_id":  "CeqOqUPUgHJ2TflR"
                  },
                  {
                      "img":  "icons/svg/book.svg",
                      "type":  "feat",
                      "system":  {
                                     "source":  {
                                                    "book":  "Flee, Mortals!"
                                                },
                                     "actionType":  "save",
                                     "description":  {
                                                         "value":  "\u003cp\u003eXorannox creates three of the following psionic eye effects. Unless otherwise stated, each eye targets a creature who he can see within 120 feet of him. He can\u0027t use the same effect twice on a turn.\n1. Charm Beam. The targeted creature must succeed on a DC 17 Wisdom saving throw or be charmed by Xorannox for 1 hour, or until he harms the creature or one of their allies.\n2. Compulsion Beam. The targeted creature must succeed on a DC 17 Intelligence saving throw or use their reaction, if available, to move up to their speed toward the closest ally they can see and make one weapon attack against them. Creatures who can\u0027t be charmed are unaffected.\n3. Memory Beam. The targeted creature must make a DC 17 Intelligence saving throw. On a failed save, if the creature has unexpended spell slots, they expend a spell slot of their highest remaining level, with no effect. If they don\u0027t have unexpended spell slots, they instead lose proficiency with a weapon they\u0027re holding or carrying for 1 minute (save ends at end of turn).\n4. Toxic Vapors. Xorannox chooses a point he can see within 120 feet of him. Each creature within 10 feet of the point must succeed on a DC 17 Constitution saving throw or be poisoned for 1 minute (save ends at end of turn).\n5. Telekinetic Field. Xorannox chooses a point he can see within 120 feet of him. Each enemy within 10 feet of the point must succeed on a DC 17 Strength saving throw or be moved up to 30 feet in any direction and take 7 (2d6) force damage at the end of the move. Additionally, Xorannox can target any object within 10 feet of the point that weighs 300 pounds or less and isn\u0027t being worn or carried, moving it up to 30 feet in any direction. Xorannox can also exert fine control on objects with this effect, such as manipulating a simple tool or opening a door or a container.\n6. Lightning Bolt. Xorannox shoots a 5-foot-wide, 60-foot-long line of lightning. Each creature in the line must succeed on a DC 17 Dexterity saving throw, taking 36 (8d8) lightning damage on a failed save, or half as much damage on a successful one.\n7. Explosion. Xorannox chooses a point he can see within 120 feet of him. Each creature within 10 feet of the point must make a DC 17 Dexterity saving throw, taking 36 (8d8) fire damage on a failed save, or half as much damage on a successful one.\n8. Necrosis Beam. The targeted creature must succeed on a DC 17 Constitution saving throw or immediately take 55 (10d10) necrotic damage and lose 7 (2d6) hit points at the start of each of their turns. If this effect reduces a target\u0027s hit points to 0, they die. The effect ends if Xorannox dies or can\u0027t see the target. This psionic effect can\u0027t be used again while this effect persists.\u003c/p\u003e"
                                                     },
                                     "uses":  {
                                                  "recovery":  [

                                                               ],
                                                  "per":  null,
                                                  "value":  null,
                                                  "max":  ""
                                              },
                                     "activation":  {
                                                        "cost":  1,
                                                        "type":  "action"
                                                    },
                                     "damage":  {
                                                    "parts":  [
                                                                  [
                                                                      "2d6",
                                                                      "force"
                                                                  ]
                                                              ]
                                                },
                                     "save":  {
                                                  "dc":  17,
                                                  "ability":  "wis",
                                                  "scaling":  "flat"
                                              }
                                 },
                      "name":  "Eye Psionics",
                      "_id":  "SzxpW5iqAo9JdI7F"
                  },
                  {
                      "type":  "feat",
                      "img":  "icons/svg/wing.svg",
                      "name":  "The Great Eye (Recharge 6)",
                      "system":  {
                                     "uses":  {
                                                  "recovery":  [

                                                               ],
                                                  "per":  "charges",
                                                  "value":  1,
                                                  "max":  "1"
                                              },
                                     "activation":  {
                                                        "cost":  1,
                                                        "type":  "bonus"
                                                    },
                                     "description":  {
                                                         "value":  "\u003cp\u003eXorannox\u0027s central eye turns solid black and projects a 150-foot cone of energy. If Xorannox or any creature in that area is affected by a spell, the spell\u0027s effects immediately end for that creature.\u003c/p\u003e"
                                                     },
                                     "source":  {
                                                    "book":  "Flee, Mortals!"
                                                }
                                 },
                      "_id":  "cDLEH8PLO4LWqE5F"
                  },
                  {
                      "type":  "feat",
                      "img":  "icons/svg/shield.svg",
                      "name":  "Cower! When a creature hits Xorannox with an attack, he shoots a psionic fear beam at them",
                      "system":  {
                                     "source":  {
                                                    "book":  "Flee, Mortals!"
                                                },
                                     "actionType":  "save",
                                     "description":  {
                                                         "value":  "\u003cp\u003eThe creature must succeed on a DC 17 Wisdom saving throw or take 21 (6d6) psychic damage and be frightened of Xorannox for 1 minute (save ends at end of turn).\u003c/p\u003e"
                                                     },
                                     "uses":  {
                                                  "recovery":  [

                                                               ],
                                                  "per":  null,
                                                  "value":  null,
                                                  "max":  ""
                                              },
                                     "activation":  {
                                                        "cost":  1,
                                                        "type":  "reaction"
                                                    },
                                     "damage":  {
                                                    "parts":  [
                                                                  [
                                                                      "6d6",
                                                                      "psychic"
                                                                  ]
                                                              ]
                                                },
                                     "save":  {
                                                  "dc":  17,
                                                  "ability":  "wis",
                                                  "scaling":  "flat"
                                              }
                                 },
                      "_id":  "gOY1wwND51Wh4kla"
                  },
                  {
                      "type":  "feat",
                      "img":  "icons/svg/terror.svg",
                      "name":  "Villain Action 1: Disruption Beams",
                      "system":  {
                                     "source":  {
                                                    "book":  "Flee, Mortals!"
                                                },
                                     "actionType":  "save",
                                     "description":  {
                                                         "value":  "\u003cp\u003eXorannox shoots a psionic disruption beam at three creatures he can see within 120 feet of him. Each target must make a DC 17 Wisdom saving throw. On a failed save, whenever the target makes more than one weapon attack on a turn or casts a spell that isn\u0027t a cantrip, they take 14 (4d6) psychic damage. This effect lasts for 1 minute (save ends at end of turn).\u003c/p\u003e"
                                                     },
                                     "uses":  {
                                                  "recovery":  [

                                                               ],
                                                  "per":  null,
                                                  "value":  null,
                                                  "max":  ""
                                              },
                                     "activation":  {
                                                        "cost":  1,
                                                        "type":  "special"
                                                    },
                                     "damage":  {
                                                    "parts":  [
                                                                  [
                                                                      "4d6",
                                                                      "psychic"
                                                                  ]
                                                              ]
                                                },
                                     "save":  {
                                                  "dc":  17,
                                                  "ability":  "wis",
                                                  "scaling":  "flat"
                                              }
                                 },
                      "_id":  "3PJRrvgo7seAA8fd"
                  },
                  {
                      "type":  "feat",
                      "img":  "icons/svg/terror.svg",
                      "name":  "Villain Action 2: Disappearing Act",
                      "system":  {
                                     "uses":  {
                                                  "recovery":  [

                                                               ],
                                                  "per":  null,
                                                  "value":  null,
                                                  "max":  ""
                                              },
                                     "activation":  {
                                                        "cost":  1,
                                                        "type":  "special"
                                                    },
                                     "description":  {
                                                         "value":  "\u003cp\u003eXorannox turns invisible until the end of his next turn and teleports up to 120 feet to an unoccupied space he can see.\u003c/p\u003e"
                                                     },
                                     "source":  {
                                                    "book":  "Flee, Mortals!"
                                                }
                                 },
                      "_id":  "VAvCy3hVG0Rb1fFZ"
                  },
                  {
                      "type":  "feat",
                      "img":  "icons/svg/terror.svg",
                      "name":  "Villain Action 3: Megabeam",
                      "system":  {
                                     "uses":  {
                                                  "recovery":  [

                                                               ],
                                                  "per":  null,
                                                  "value":  null,
                                                  "max":  ""
                                              },
                                     "activation":  {
                                                        "cost":  1,
                                                        "type":  "special"
                                                    },
                                     "description":  {
                                                         "value":  "\u003cp\u003eXorannox unleashes the effects of all of his remaining psionic eyes at once in a 20-foot-wide, 120-foot-long line. Each creature in that area must make a save against two random eye effects from Xorannox\u0027s Eye Psionics (reroll duplicates for each target). If the effect usually affects an area, it instead only affects individual creatures.\u003c/p\u003e"
                                                     },
                                     "source":  {
                                                    "book":  "Flee, Mortals!"
                                                }
                                 },
                      "_id":  "BSbzcF9GvEutOhU1"
                  }
              ],
    "effects":  [

                ],
    "prototypeToken":  {
                           "name":  "Xorannox",
                           "displayName":  20,
                           "actorLink":  false,
                           "texture":  {
                                           "src":  "modules/flee-mortals-custom/tokens/xorannox.webp",
                                           "scaleX":  1,
                                           "scaleY":  1
                                       },
                           "width":  2,
                           "height":  2,
                           "disposition":  -1,
                           "displayBars":  20,
                           "bar1":  {
                                        "attribute":  "attributes.hp"
                                    },
                           "sight":  {
                                         "enabled":  true,
                                         "range":  0
                                     }
                       },
    "flags":  {
                  "flee-mortals-custom":  {
                                              "role":  "Solo",
                                              "category":  "",
                                              "source":  "Flee, Mortals!"
                                          }
              }
}
